tap "bufbuild/buf"
tap "buo/cask-upgrade"
tap "encoredev/tap"
tap "int128/kubelogin"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "veeso/termscp"
# Statistics utility to count lines of code
brew "cloc"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Rust toolchain installer
brew "rustup"
# SMART hard drive monitoring
brew "smartmontools"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# The static analysis-powered Go framework for building backend applications
brew "encoredev/tap/encore"
# A kubectl plugin for Kubernetes OpenID Connect authentication
brew "int128/kubelogin/kubelogin"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# A feature rich terminal file transfer and explorer with support for SCP/SFTP/FTP/S3/Kube/SMB/WebDAV
brew "veeso/termscp/termscp"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Multi-track audio editor and recorder
cask "audacity"
# Display management tool
cask "betterdisplay"
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Desktop client for brain.fm
cask "brainfm"
# E-books management software
cask "calibre"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Image, video and clipboard optimiser
cask "clop"
# Tool to run Windows software
cask "crossover"
# Voice and text chat software
cask "discord"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Host-based application firewall
cask "little-snitch"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Lyrics for Apple Music and Spotify
cask "lyric-fever"
# Replacement for Docker Desktop
cask "orbstack"
# WebKit based web browser
cask "orion"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# PDF viewer designed for reading research papers and technical books
cask "sioyek"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "Bitwarden", id: 1352778147
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "rcmd", id: 1596283165
mas "Supernote Partner", id: 1494992020
go "github.com/bonnefoa/kubectl-fzf/v3/cmd/kubectl-fzf-completion"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
