tap "buo/cask-upgrade"
tap "nikitabobko/tap"
tap "oven-sh/bun"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Official Amazon AWS command-line interface
brew "awscli"
# Statistics utility to count lines of code
brew "cloc"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Build control planes without needing to write code
brew "crossplane"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Display management tool
cask "betterdisplay"
# E-books management software
cask "calibre"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Clipboard extension app
cask "clipy"
# Image, video and clipboard optimiser
cask "clop"
# Voice and text chat software
cask "discord"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Host-based application firewall
cask "little-snitch"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Replacement for Docker Desktop
cask "orbstack"
# WebKit based web browser
cask "orion"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Google Chromium, sans integration with Google
cask "ungoogled-chromium"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "Bitwarden", id: 1352778147
mas "Infuse", id: 1136220934
mas "rcmd", id: 1596283165
