tap "bufbuild/buf"
tap "buo/cask-upgrade"
tap "encoredev/tap"
tap "hamed-elfayome/claude-usage"
tap "int128/kubelogin"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "veeso/termscp"
# Official Amazon AWS command-line interface
brew "awscli"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# SMART hard drive monitoring
brew "smartmontools"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# The static analysis-powered Go framework for building backend applications
brew "encoredev/tap/encore"
# A kubectl plugin for Kubernetes OpenID Connect authentication
brew "int128/kubelogin/kubelogin"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# A feature rich terminal file transfer and explorer with support for SCP/SFTP/FTP/S3/Kube/SMB/WebDAV
brew "veeso/termscp/termscp"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Multi-track audio editor and recorder
cask "audacity"
# Menu bar icon organiser
cask "bartender"
# Display management tool
cask "betterdisplay"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Desktop client for brain.fm
cask "brainfm"
# E-books management software
cask "calibre"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Image, video and clipboard optimiser
cask "clop"
# Tool to run Windows software
cask "crossover"
# Disk space visualiser
cask "daisydisk"
# Voice and text chat software
cask "discord"
cask "font-iosevka"
# Free and open-source media player
cask "iina"
# System monitoring app
cask "istat-menus"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Host-based application firewall
cask "little-snitch"
# Discover, download, and run local LLMs
cask "lm-studio"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Lyrics for Apple Music and Spotify
cask "lyric-fever"
# Replacement for Docker Desktop
cask "orbstack"
# WebKit based web browser
cask "orion"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# PDF viewer designed for reading research papers and technical books
cask "sioyek"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Open-source code editor
cask "visual-studio-code@insiders"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "rcmd", id: 1596283165
mas "Supernote Partner", id: 1494992020
vscode "drblury.protobuf-vsc"
vscode "enkia.tokyo-night"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "vscodevim.vim"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/expanse-labs/monorepo/cli"
go "github.com/expanse-labs/monorepo/daemon/cmd/expanse-daemon"
go "golang.org/x/tools/gopls"
go "github.com/bonnefoa/kubectl-fzf/v3/cmd/kubectl-fzf-completion"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
